
{
  "Wakari Senju": [
    {
      "name": "Energy Infusion – Full Body",
      "description": "Channels raw energy into any part of his body for explosive combat power."
    },
    {
      "name": "Purple Surge – Inner Focus",
      "description": "Enters a heightened energetic state where his aura amplifies all senses despite blindness."
    },
    {
      "name": "Signature Form – Echo of the Senju",
      "description": "A transformation channeling ancestral martial spirits through his aura and strikes."
    },
    {
      "name": "Echo Sense",
      "description": "Using vibration and energetic frequency, Wakari 'sees' the world without sight."
    },
    {
      "name": "Rising Strike – Crescent Palm",
      "description": "A spiritual martial technique passed down from Cartier Karo’s lineage, infused with kinetic Chi."
    }
  ],
  "Asa Knight": [
    {
      "name": "Healing Light Pulse",
      "description": "Generates restorative light that can mend severe wounds or revive allies from near-death."
    },
    {
      "name": "Energetic Surge – Bloom of Resilience",
      "description": "Asa’s aura flares with pink flower petals and healing waves, enhancing her allies' stamina and focus."
    },
    {
      "name": "Spirit Infusion – Lotus Heart",
      "description": "A form where she bonds with an ancient spirit of light, boosting speed, light affinity, and resistance to corruption."
    },
    {
      "name": "Radiant Bloom Barrier",
      "description": "Summons a radiant dome of light infused with pink petals that blocks incoming energy attacks and gradually heals all inside."
    },
    {
      "name": "Essence Petal Rain",
      "description": "Channels emotional energy into falling ethereal petals that purify curses, remove ailments, and boost the energy flow of all allies they touch."
    }
  ],
  "Miguel Senju": [
    {
      "name": "Dual Surge Manifestation",
      "description": "Blue and purple energy wielded in both hands, enhancing tactical offense."
    },
    {
      "name": "Momentum Reversal",
      "description": "Shifts kinetic force of attacks mid-combat."
    },
    {
      "name": "Energetic Surge",
      "description": "Early-stage form with unique aura balance."
    },
    {
      "name": "Chi Thread Redirection",
      "description": "Manipulates residual energy trails to weave chi threads mid-air."
    },
    {
      "name": "Split Nexus Pulse",
      "description": "Briefly separates the blue and purple energies into autonomous extensions of Miguel’s will."
    }
  ],
  "Kael Ranmaru": [
    {
      "name": "Lightning Dash Assault",
      "description": "Kael vanishes in a blink and unleashes a flurry of high-speed charged strikes."
    },
    {
      "name": "Energetic Surge – Flash Overdrive",
      "description": "In this form, Kael’s hair glows yellow and his body crackles with lightning, doubling his speed and reflexes."
    },
    {
      "name": "Signature Move – Thunder Collapse",
      "description": "Channels lightning into the ground to erupt in a dome-shaped blast that paralyzes and scorches opponents."
    },
    {
      "name": "Volt Mirage",
      "description": "Kael creates afterimages made of pure lightning that move independently for a few seconds. These illusions can detonate on contact or act as feints in battle."
    },
    {
      "name": "Plasma Vein Surge",
      "description": "Temporarily converts Kael’s blood into hyper-conductive plasma, causing his strikes to ignore physical resistance and leaving streaks of residual lightning that chain between targets."
    }
  ],
  "Thalon the Shadowblade": [
    {
      "name": "Shadow Slip",
      "description": "Vanishes into surfaces and reappears unpredictably."
    },
    {
      "name": "Tidal Slice",
      "description": "Channeling water blades into martial strikes."
    },
    {
      "name": "Surge Form – Abyssal Stalker",
      "description": "Full Murkfolk energy unleash, eyes glow gold."
    },
    {
      "name": "Blackwater Shroud",
      "description": "A dense mist infused with shadow and aquatic energy blankets the field."
    },
    {
      "name": "Echo Fang Torrent",
      "description": "Thalon unleashes multiple delayed shadow-water slashes from different angles that converge after a delay."
    }
  ],
  "Sahil the Warlock": [
    {
      "name": "Void Infusion",
      "description": "Forbidden Dark Energy channeled through a cursed gauntlet that consumes life force."
    },
    {
      "name": "Shadowflame Spiral",
      "description": "Combines dark flame and shadow energy into an explosive barrage."
    },
    {
      "name": "Surge Form – Abysscaller",
      "description": "Enhanced mode with flaring horn and dark mist rising from his corrupted arm."
    },
    {
      "name": "Null Brand Detonation",
      "description": "Marks a target with a sigil of decay; detonates into a vortex of anti-energy that erases buffs and seals abilities."
    },
    {
      "name": "Dread Crown Awakening",
      "description": "Calls upon the latent power within his cursed horn for an unstable, godlike energy boost."
    }
  ],
  "Nyxis": [
    {
      "name": "Nuclear Shadow Daggers",
      "description": "Twin energy blades that phase through armor and disrupt life energy."
    },
    {
      "name": "Assassin’s Echo",
      "description": "Mimics opponent’s last move within 1 second of witnessing it."
    },
    {
      "name": "Silent Erasure",
      "description": "Becomes undetectable by sight, sound, or energy sensors for a short burst."
    },
    {
      "name": "Radiocide Pulse",
      "description": "Unleashes a silent nuclear shockwave that fries tech and scorches the environment in a crescent arc."
    },
    {
      "name": "Oblivion Step",
      "description": "A teleportation-like dash through shadow and radiation, degrading space for energy users that follow."
    }
  ],
  "Joann Senju": [
    {
      "name": "Spirit Bloom Barrier",
      "description": "Joann summons a radiant shield of ethereal light energy, enveloping allies in a protective dome that deflects incoming attacks and soothes wounds with gentle spiritual resonance, a hallmark of her role as the Senju matriarch."
    },
    {
      "name": "Healing Flow Technique",
      "description": "Channels a serene stream of light energy through her hands, rapidly mending injuries and restoring vitality to allies. This technique, rooted in her mastery of emotional energy, fosters hope and resilience in battle."
    },
    {
      "name": "Ancestral Memory Pulse",
      "description": "Emits a vibrant pulse of ethereal energy, invoking ancestral Senju spirits to inspire allies. The pulse enhances focus and morale, connecting fighters to the wisdom and strength of their lineage."
    },
    {
      "name": "Serenity Field",
      "description": "Creates a calming field of light energy that radiates peace, reducing enemy hostility and bolstering ally defenses. Joann’s serene aura pacifies chaotic energies, making it a vital support technique."
    },
    {
      "name": "Ethereal Tide Call",
      "description": "Summons a surging tide of ethereal energy that disrupts enemy formations. This spiritual wave, infused with light, cleanses negative effects and empowers allies with renewed vigor in combat."
    }
  ],
  "Cartier Karo": [
    {
      "name": "Crimson Impact Drive",
      "description": "Unleashes a devastating strike infused with kinetic chi, channeling the Senju-Karo lineage’s martial prowess. The crimson energy surge delivers bone-shattering force, capable of breaking through even the toughest defenses."
    },
    {
      "name": "Bonequake Step",
      "description": "Stomps the ground with immense force, triggering seismic tremors infused with chi energy. This technique, passed down through generations, destabilizes enemies and creates openings for Cartier’s legendary martial attacks."
    },
    {
      "name": "Karo Fist Lineage Break",
      "description": "Delivers a powerful punch imbued with ancestral chi, shattering enemy barriers. The technique embodies the Karo family’s martial tradition, combining raw strength with spiritual energy to overwhelm foes."
    },
    {
      "name": "Pressure Pulse Cannon",
      "description": "Fires a concentrated blast of kinetic energy, propelled by Cartier’s mastery of chi. The high-pressure pulse pierces defenses, delivering explosive impact to single targets or small groups."
    },
    {
      "name": "Guardian's Warcry",
      "description": "Emits a commanding shout infused with chi, rallying allies and intimidating enemies. This ancestral technique boosts team morale and temporarily enhances physical strength, reflecting Cartier’s role as a protector."
    }
  ],
  "Deaengelo Senju": [
    {
      "name": "Hollow Spiral Flame",
      "description": "Spins a vortex of dark flames, fueled by his obsession with destructive power. This chaotic energy engulfs enemies in a spiraling inferno, burning through defenses and leaving a trail of corrosive ash."
    },
    {
      "name": "Dark Chi Reversal",
      "description": "Redirects enemy energy with dark chi, turning their attacks against them. Deaengelo’s mastery of forbidden energies allows him to manipulate and corrupt incoming forces, destabilizing opponents in combat."
    },
    {
      "name": "Vengeful Surge",
      "description": "Unleashes a surge of dark energy, amplifying his destructive capabilities. This vengeful burst, driven by Deaengelo’s inner rage, enhances his attacks and overwhelms foes with raw, chaotic power."
    },
    {
      "name": "Shadowbrand Clutch",
      "description": "Traps enemies in a shadowy grasp of dark energy, immobilizing them. Deaengelo’s technique brands foes with a corrosive sigil, draining their strength while bolstering his own destructive force."
    },
    {
      "name": "Nexus Breach Infusion",
      "description": "Infuses attacks with chaotic dark energy, breaching the Nexus’s stability. Deaengelo’s forbidden technique destabilizes energy fields, amplifying his strikes with unpredictable, devastating power."
    }
  ],
  "Aman Senju": [
    {
      "name": "Whisperwind Slash",
      "description": "Delivers a swift, precise slash infused with wind and ethereal energy. Aman’s calm precision slices through defenses, channeling natural energy to disrupt enemy formations with graceful, flowing strikes."
    },
    {
      "name": "Nature Pulse Harmonization",
      "description": "Emits a soothing pulse of natural energy, harmonizing allies with the environment. Aman’s technique restores stamina and enhances focus, drawing strength from the earth to support his team."
    },
    {
      "name": "Chi Feedback Loop",
      "description": "Creates a cyclical flow of chi energy, amplifying ally abilities. Aman’s technique redirects ambient energy to boost team performance, reflecting his role as a composed support fighter."
    },
    {
      "name": "Ethereal Lull",
      "description": "Projects an ethereal aura that calms enemies and reduces aggression. Aman’s light energy technique soothes chaotic battlefields, creating openings for strategic maneuvers and ally recovery."
    },
    {
      "name": "Senju Root Technique",
      "description": "Channels natural energy through roots, anchoring allies and disrupting foes. Aman’s technique strengthens defenses and grounds energy flows, embodying the Senju legacy of balance and resilience."
    }
  ],
  "Rina Nakamura": [
    {
      "name": "Liquid Construct Blade",
      "description": "Forms a razor-sharp blade of water energy, slicing through defenses. Rina’s mastery of water constructs delivers precise, fluid strikes, cutting enemies with the relentless force of a rushing current."
    },
    {
      "name": "Aqua Barrier Bloom",
      "description": "Summons a blooming shield of water energy, deflecting attacks. Rina’s defensive construct absorbs impacts and releases a soothing mist, protecting allies while maintaining her fluid combat style."
    },
    {
      "name": "Flow Pulse Cage",
      "description": "Traps enemies in a pulsating cage of water energy, restricting movement. Rina’s technique creates a swirling vortex that confines foes, allowing allies to strike with tactical precision."
    },
    {
      "name": "Rippling Deflect",
      "description": "Generates a rippling water energy barrier that redirects enemy attacks. Rina’s fluid defense reflects energy assaults, using the momentum of water to protect allies and disrupt opponents."
    },
    {
      "name": "Rising Wave Formation",
      "description": "Unleashes a surging wave of water energy, overwhelming enemy lines. Rina’s technique floods the battlefield with powerful currents, pushing back foes and supporting allies with dynamic force."
    }
  ],
  "Kaito Tanaka": [
    {
      "name": "Ethereal Projection",
      "description": "Projects an ethereal form of wind energy, confusing enemies. Kaito’s tactical technique creates a ghostly duplicate that distracts foes, allowing rapid repositioning and strategic strikes in combat."
    },
    {
      "name": "Gale Burst Dash",
      "description": "Dashes forward with a burst of wind energy, enhancing speed. Kaito’s rapid movement creates a gale-force shockwave, knocking back enemies and setting up devastating follow-up attacks."
    },
    {
      "name": "Wind Shield Layer",
      "description": "Forms a layered shield of wind energy, deflecting projectiles. Kaito’s defensive technique swirls air currents around allies, protecting them from attacks while maintaining his mobility."
    },
    {
      "name": "Cyclone Deflect Pulse",
      "description": "Emits a pulsating cyclone of wind energy, redirecting assaults. Kaito’s technique creates a spinning vortex that deflects enemy attacks and disrupts their positioning on the battlefield."
    },
    {
      "name": "Updraft Combo Flurry",
      "description": "Unleashes a flurry of wind-infused strikes, propelled by updrafts. Kaito’s rapid combo overwhelms enemies with relentless attacks, using his wind mastery to dominate aerial combat."
    }
  ],
  "Haku Sharma": [
    {
      "name": "Ember Palm Strike",
      "description": "Delivers a fiery palm strike infused with kinetic fire energy. Haku’s tribal technique scorches enemies with explosive force, embodying his brawler spirit in devastating close-combat attacks."
    },
    {
      "name": "Kinetic Flame Barrage",
      "description": "Unleashes a barrage of kinetic fire energy, overwhelming foes. Haku’s relentless assault rains fiery blows, combining raw power with tribal ferocity to incinerate enemy defenses."
    },
    {
      "name": "Blazing Counter",
      "description": "Counters attacks with a sudden burst of fire energy. Haku’s technique turns enemy strikes into opportunities, enveloping assailants in flames while maintaining his aggressive combat stance."
    },
    {
      "name": "Fire Spiral Kick",
      "description": "Spins into a fiery kick, propelled by kinetic fire energy. Haku’s tribal technique delivers a spiraling blaze, striking multiple enemies with explosive force and dynamic momentum."
    },
    {
      "name": "Pressure Chain Break",
      "description": "Breaks enemy formations with a chain of fiery energy bursts. Haku’s technique unleashes relentless pressure, disrupting foes with kinetic flames and asserting his dominance in battle."
    }
  ],
  "Dawn Blakes": [
    {
      "name": "Thunderclash Burst",
      "description": "Unleashes a thunderous burst of lightning and fire energy. Dawn’s nexus-level power electrifies and incinerates foes, creating a devastating explosion that showcases her unmatched elemental prowess."
    },
    {
      "name": "Ember Lance Drive",
      "description": "Thrusts a lance of fire energy, charged with lightning. Dawn’s technique pierces defenses with searing precision, combining fiery intensity and electric force to overwhelm her opponents."
    },
    {
      "name": "Surge Ignition Overload",
      "description": "Triggers an overload of fire and lightning energy, devastating enemies. Dawn’s surge creates a chaotic blast, amplifying her nexus-level power to dominate the battlefield with elemental fury."
    },
    {
      "name": "Sparkblade Reversal",
      "description": "Counters with a spark-infused blade of fire energy. Dawn’s technique redirects enemy attacks, slashing with electrified flames to turn the tide of battle in her favor."
    },
    {
      "name": "Phoenix Arc Discharge",
      "description": "Releases an arc of phoenix-like fire and lightning energy. Dawn’s technique engulfs enemies in a radiant discharge, reviving her resolve while scorching foes with elemental power."
    },
    
